phrase = input()

if phrase in ['Привіт', 'Хай', 'Доброго дня']:
    print('Доброго вечора, я бот з України!')
elif phrase in ['Як справи?', 'Що робиш?', 'Чим займаєшся?']:
    print('Вчусь програмувати на Python!')
elif phrase in ['Фільм', 'Кінотеатр',  'Серіал']:
    print('Соррі що втручуюсь, не знаю про що йдеться мова, але подивіться серіал Карточный домик, він просто бомба!!')
elif phrase in ['Бувай', 'Надобраніч', 'Гудбай', 'До зустрічі']:
    print('Побачимось у мережі, I will be back.')
else:
    print('Дуже цікаво, але, нажаль, ніфіга не зрозуміло :( ')
